cfd/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    0;
    object      U;
}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0.0 0.0 0.0);
boundaryField
{
    wall
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    XMin0
    {
        type fixedValue;
        value uniform (1 0 0);
    }
    XMax0
    {
        type zeroGradient;
    }
    YMin0
    {
        type slip;
    }
    YMax0
    {
        type slip;
    }
    ZMin0
    {
        type slip;
    }
    ZMax0
    {
        type slip;
    }
    defaultFaces
    {
        type slip;
    }
}
