cfd/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      epsilon;
}
dimensions [0 2 -3 0 0 0 0];
internalField uniform 0.001;
boundaryField
{
    wall
    {
        type epsilonWallFunction;
        value uniform 0.0;
    }
    XMin0
    {
        type fixedValue;
        value uniform 0.01;
    }
    XMax0
    {
        type zeroGradient;
    }
    YMin0
    {
        type zeroGradient;
    }
    YMax0
    {
        type zeroGradient;
    }
    ZMin0
    {
        type zeroGradient;
    }
    ZMax0
    {
        type zeroGradient;
    }
    defaultFaces
    {
        type zeroGradient;
    }
}
