cfd/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      nut;
}
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0.001;
boundaryField
{
    wall
    {
        type nutkWallFunction;
        value uniform 0.0;
    }
    XMin0
    {
        type calculated;
        value uniform 0.001;
    }
    XMax0
    {
        type calculated;
        value uniform 0.001;
    }
    YMin0
    {
        type zeroGradient;
    }
    YMax0
    {
        type zeroGradient;
    }
    ZMin0
    {
        type zeroGradient;
    }
    ZMax0
    {
        type zeroGradient;
    }
    defaultFaces
    {
        type zeroGradient;
    }
}
