cfd/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      p;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.0;
boundaryField
{
    wall
    {
        type zeroGradient;
    }
    XMin0
    {
        type zeroGradient;
    }
    XMax0
    {
        type totalPressure;
        p0 uniform 0.0;
        value uniform 0.0;
    }
    YMin0
    {
        type zeroGradient;
    }
    YMax0
    {
        type zeroGradient;
    }
    ZMin0
    {
        type zeroGradient;
    }
    ZMax0
    {
        type zeroGradient;
    }
    defaultFaces
    {
        type zeroGradient;
    }
}
