cfd/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
vertices
(
  (-10 -2 -2)
  (10 -2 -2)
  (10 4 -2)
  (-10 4 -2)
  (-10 -2 4)
  (10 -2 4)
  (10 4 4)
  (-10 4 4)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (64 32 32) simpleGrading (1 1 1)
);
defaultPatch
{
  type patch;
}
boundary (
  XMin0
  {
    type patch;
    faces
    (
      (0 4 7 3)
    );
  }
  XMax0
  {
    type patch;
    faces
    (
      (1 2 6 5)
    );
  }
  YMin0
  {
    type wall;
    faces
    (
      (0 1 5 4)
    );
  }
  YMax0
  {
    type wall;
    faces
    (
      (3 7 6 2)
    );
  }
  ZMin0
  {
    type wall;
    faces
    (
      (0 3 2 1)
    );
  }
  ZMax0
  {
    type wall;
    faces
    (
      (4 5 6 7)
    );
  }
);
