cfd/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     foamRun;
solver          incompressibleFluid;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1000;
deltaT          1.0;
adjustTimeStep  off;
maxCo           0.9;
writeControl    timeStep;
writeInterval   1000;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable on;

functions
{
    #includeFunc residuals(U,p,k,epsilon);
    #includeFunc yPlus;
    
    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   1;
        
        patches         (wall);
        
        rho             rhoInf;
        rhoInf          1.0;
        UInf            (1.0 0.0 0.0);
        Aref            1.0;
        CofR            (0.0 0.0 0.0);
        
        liftDir         (0.0 1.0 0.0);
        dragDir         (1.0 0.0 0.0);
        pitchAxis       (0.0 0.0 1.0);
        
        magUInf 1.0;
        lRef 1.0;
    }
}